# BD_laboratornaya_rabota_2
Выполнение лабораторной работы №2 по дисциплине Технология Big Data.
Цель лабораторной работы: научиться создавать системы работы с потоками данных с использованием инструмента Apache Airflow.
Задачи лабораторной работы:
1)	развернуть приложение Apache Airflow;
2)	разработать DAG;
3)	поставить DAG на выполнение в Apache Airflow.
Выполняемый вариант (согласно таблице в приложении 1): февраль, 01-10 – служба доставки еды (Рестораны, меню, клиенты, курьеры, заказы, отзывы).
Ход лабораторной работы
Задача 1. Развернуть приложение Apache Airflow.
Так как официально Apache Airflow не поддерживает Windows, для работы ему нужны специфичные для Linux-систем модули (например, fcntl), которых нет в Windows. Эта проблема решается установкой подсистемы WSL2 (Windows Subsystem for Linux) – это встроенная в Windows возможность запускать полноценное ядро Linux. Для этого в Windows Powershell команду «wsl --install», после чего система предложит установить создать пользователя и пароль для вашего Linux-окружения (в данном случае Ubuntu). Пароль следует запоминать, поскольку он будет запрашиваться для подтверждения действий пользователя. После установки все действия будут происходить в терминале Ubuntu.
 
Подготовим окружение для установки Apache Airflow. Создаем папку проекта в домашней директории Linux командой «mkdir ~/bigdata_lab_airflow» и переходим в нее по команде «cd ~/bigdata_lab_airflow». Создаем виртуальное окружение для выполнения лабораторной работы по команде «python3 -m venv airflow_env». Активируем виртуальное окружение по команде «source airflow_env/bin/activate». Завершив подготовку окружения, устанавливаем Apache Airflow по команде «pip install apache-airflow».
Произведем проверку версии Python с помощью команды «python3 --version».
 
Для хранения метаданных Airflow была задана переменная окружения AIRFLOW_HOME (команда «export AIRFLOW_HOME="$(pwd)/airflow"»), указывающая на директорию проекта, после чего выполнена миграция базы данных по команде «airflow db migrate». В результате выполнения команды в директории ~/bigdata_lab_airflow/airflow была создана база данных SQLite (airflow.db) и все необходимые служебные таблицы.
Для доступа к веб-интерфейсу был создан пользователь с правами администратора: «airflow users create \
    --username admin \
    --firstname Maria \
    --lastname Student \
    --role Admin \
    --email maria@lab.local».
При выполнении команды был задан пароль, который в дальнейшем использовался для входа в систему.
С целью упрощения локального запуска всех компонентов Airflow был использован встроенный режим standalone, который запускает веб-сервер, планировщик и инициализирует необходимые процессы в одном экземпляре. Для предотвращения возможного конфликта портов с уже работающими службами (например, PostgreSQL) в конфигурационном файле airflow.cfg был изменен параметр web_server_port на значение 8081. После этого выполнен запуск команды «airflow standalone». После завершения инициализации веб-интерфейс стал доступен по адресу http://localhost:8081. Вход был осуществлен с использованием созданных ранее учетных данных (логин admin, пароль [ ]). Успешная авторизация подтвердила корректность установки и настройки всех компонентов Apache Airflow.
Задача 2. Разработать DAG.
Для проверки работоспособности системы был разработан простой DAG (Directed Acyclic Graph), состоящий из трех задач, выполняющих вывод сообщений и вычисление арифметического выражения. Файл «my_first_dag.py» был размещен в директории ~/bigdata_lab_airflow/airflow/dags. Полный код DAG размещен в Приложении 1 настоящего отчета.
Задача 3. Поставить DAG на выполнение в Apache Airflow.
Созданный DAG автоматически обнаруживается Airflow при сканировании папки dags (по умолчанию каждые 30 секунд). В веб-интерфейсе DAG my_first_data_pipeline появился в общем списке. Для активации его работы в соответствии с расписанием был использован переключатель «On/Off». Ручной запуск в целях немедленной проверки функциональности выполнен соответствующей кнопкой (Trigger DAG). Все три задачи успешно выполнились, что отобразилось темно-зеленым цветом на графе DAG.
 
Заключение и выводы
В ходе выполнения лабораторной работы был успешно развернут Apache Airflow, создан и запущен DAG, реализующий простой конвейер обработки данных. Получены практические навыки работы с основными компонентами Airflow: веб-сервером, планировщиком, базой метаданных, операторами. Изучен принцип описания рабочих процессов в виде направленного ациклического графа. В результате работы получены навыки по использованию Apache Airflow для оркестрации задач обработки данных.
 
Приложение 1
from datetime import datetime, timedelta
from airflow import DAG
from airflow.operators.python import PythonOperator

default_args = {
        'owner': 'student',
        'depends_on_past': False,
        'start_date': datetime(2024, 1, 1),
        'email_on_failure':  False,
        'email_on_retry': False,
        'retries': 1,
        'retry_delay': timedelta(minutes=5)
}
def say_hello():
        print("Здравствуйте, Владимир  Александрович!")

def say_world():
        print("Es mi primero DAG en Airflow!")

def calculate_sum():
        result = 4 + 6
        print("Результат вычисления 4 + 6 = {result}")

with DAG(
        dag_id='my_first_data_pipeline',
        default_args=default_args,
        description='Простой DAG для выполнения лабораторной работы №2',
        schedule='@daily',
        catchup=False,
        tags=['lab','tutorial']
) as dag:

        task1 = PythonOperator(task_id='print_hello', python_callable=say_hello)
        task2 = PythonOperator(task_id='print_world', python_callable=say_world)
        task3 = PythonOperator(task_id='calculate_numbers', python_callable=calculate_sum)

        task1 >> [task2, task3]
